USE education_db;

-- Группы
INSERT INTO study_groups (group_code, admission_year) VALUES
('LAW-101', 2023),
('LAW-102', 2023),
('LAW-201', 2022);

-- Преподаватели
INSERT INTO teachers (teacher_number, last_name, first_name, email) VALUES
('T-001', 'Иванов', 'Пётр', 'ivanov@uni.test'),
('T-002', 'Смирнова', 'Анна', 'smirnova@uni.test'),
('T-003', 'Кузнецов', 'Алексей', 'kuznetsov@uni.test'),
('T-004', 'Петрова', 'Мария', 'petrova@uni.test');

-- Предметы
INSERT INTO subjects (subject_name, category) VALUES
('Математика', 'MATH'),
('Статистика', 'MATH'),
('Логика', 'MATH'),
('История права', 'HUMANITIES'),
('Философия', 'HUMANITIES'),
('Экономика', 'OTHER');

-- Семестры
INSERT INTO terms (academic_year, semester_no, start_date, end_date) VALUES
(2023, 1, '2023-09-01', '2023-12-31'),
(2023, 2, '2024-02-01', '2024-06-30'),
(2024, 1, '2024-09-01', '2024-12-31');

-- Студенты
INSERT INTO students
(student_number, last_name, first_name, birth_date, email, group_id) VALUES
('S-001', 'Иванов', 'Илья', '2004-05-10', 's1@stud.test', 1),
('S-002', 'Петров', 'Андрей', '2004-06-15', 's2@stud.test', 1),
('S-003', 'Сидорова', 'Мария', '2003-03-22', 's3@stud.test', 2),
('S-004', 'Кузнецов', 'Дмитрий', '2002-11-30', 's4@stud.test', 3),
('S-006', 'Романов', 'Олег', '2004-02-02', 's6@stud.test', 1),
('S-007', 'Орлова', 'Елена', '2004-03-03', 's7@stud.test', 2);

-- Кто что ведёт
INSERT INTO course_offerings
(subject_id, teacher_id, group_id, term_id) VALUES
(1, 1, 1, 1),
(2, 2, 1, 1),
(4, 3, 1, 1),
(1, 1, 2, 1),
(5, 4, 2, 1),
(3, 1, 3, 2),
(4, 3, 3, 2),
(1, 1, 1, 3),
(6, 2, 1, 3),
(2, 1, 1, 3),
(3, 1, 1, 3),
(5, 1, 1, 3);

-- Записи студентов
INSERT INTO enrollments (student_id, offering_id, enrolled_at) VALUES
(1,1,'2023-09-10'),
(1,2,'2023-09-10'),
(1,3,'2023-09-10'),
(1,8,'2024-09-10'),
(2,1,'2023-09-10'),
(2,2,'2023-09-10'),
(2,5,'2023-09-10'),
(3,4,'2023-09-10'),
(3,5,'2023-09-10'),
(4,6,'2024-02-10'),
(4,7,'2024-02-10'),
(5,1,'2023-09-10'),
(5,2,'2023-09-10'),
(5,3,'2023-09-10'),
(5,9,'2024-09-10'),
(2,9,'2024-09-10'),
(6,4,'2023-09-10'),
(6,5,'2023-09-10');

-- Оценки
INSERT INTO grades (enrollment_id, grade_value, grade_date) VALUES
(1,5,'2023-12-20'),
(2,5,'2023-12-20'),
(3,4,'2023-12-20'),
(4,5,'2024-12-20'),
(5,4,'2023-12-20'),
(6,2,'2023-12-20'),
(7,2,'2023-12-20'),
(8,3,'2023-12-20'),
(9,5,'2023-12-20'),
(10,2,'2024-06-20'),
(11,5,'2024-06-20'),
(12,5,'2023-12-20'),
(13,5,'2023-12-20'),
(14,2,'2023-12-20'),
(15,2,'2024-12-10'),
(17,5,'2023-12-20'),
(18,5,'2023-12-20');

